#ifndef ROBOTCAN_PROPLIST_H_
#define ROBOTCAN_PROPLIST_H_
#include "RobotCAN_Basic.h"
#include "MyType.h"
#include "MyGlobe.h"


/********************************prop属性,8位*******************************/

#define GET_SINGLE_MOTOR_PARA  			  0x02   //发送帧属性,发送电机速度


#define SET_MOTORS_SPEED	   	  			0x00   //接收帧属性,设置驱动电机速度
#define SET_MOTORS_CTRL         			0x01   //接收帧属性,使能驱动电机


/*****************************************************************************/
 
/*********************************prio发送优先级,4位************************/

#define GET_SINGLE_MOTOR_PARA_PRIO    0x1

/****************************************************************************/


/*********************************CAN发送函数********************************/

void SendSingleMotorPara();     //发送电机实际速度

/****************************************************************************/

/*********************************CAN接收函数********************************/

void SetMotorsPara(Frame* frm);  //接收电机目标速度
void SetMotorsCtrl(Frame* frm);  //接收电机使能

/****************************************************************************/

#endif