#ifndef __MYGLOBLE_H
#define __MYGLOBLE_H

#include "arm_math.h"
#include "motor_control.h"
#include "MyType.h"
#include "Motor.h"

/*******************************************************************************
															   系统宏
*******************************************************************************/
/*驱动类型选择*/

/*******************************************************************************
															  全局变量
*******************************************************************************/
extern  uint32_t  CAN_feedDog ;		 //CAN总线喂狗
extern volatile MotorTypeDef EC22_Motor;
//extern volatile TestMotorTypeDef LaunchMotor;

/*******************************************************************************
															  功能函数
*******************************************************************************/
void GlobeVariableInit(void);

#endif

